
# üìä LEVEL 3 ‚Äî ADVANCED BUSINESS INSIGHTS

In [2]:
from sqlalchemy import create_engine
import pandas as pd

In [3]:
engine = create_engine('mysql+pymysql://root:password@127.0.0.1/crm_sales')

In [4]:
df = pd.read_csv('CRM_Data/sales_pipeline.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8800 entries, 0 to 8799
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   opportunity_id  8800 non-null   object
 1   sales_agent     8800 non-null   object
 2   product         8800 non-null   object
 3   account         7375 non-null   object
 4   deal_stage      8800 non-null   object
 5   engage_date     8300 non-null   object
 6   close_date      6711 non-null   object
 7   close_value     6711 non-null   float64
dtypes: float64(1), object(7)
memory usage: 550.1+ KB

### 1. Find the top 3 sales agents by total close_value from Won deals.

In [5]:
query = f"""select sales_agent,deal_stage,count(deal_stage) as Total_Won_deals,sum(close_value) as Total_values 
            from sales_pipeline 
            WHERE deal_stage = 'Won' 
            group by sales_agent 
            order by Total_values desc limit 3;"""
table_data = pd.read_sql(query, engine)
display(table_data)

       sales_agent deal_stage  Total_Won_deals  Total_values
0  Darcel Schlecht        Won              349     1153214.0
1   Vicki Laflamme        Won              221      478396.0
2  Kary Hendrixson        Won              209      454298.0

### 2. Calculate each agent‚Äôs success rate = (Number of Won deals / Total deals) * 100.

In [15]:
query = f"""SELECT 
    sales_agent,
    sum(deal_stage = 'Won') AS Total_Won_deals,
    COUNT(*) AS total_deals,
    (sum(deal_stage = 'Won') /COUNT(*))*100 as success_rate
    
FROM 
    sales_pipeline
GROUP BY 
    sales_agent
ORDER BY success_rate desc  limit 10 ;"""
table_data = pd.read_sql(query,engine)
display(table_data)

          sales_agent  Total_Won_deals  total_deals  success_rate
0        Reed Clapper            155.0          237       65.4008
1       Garret Kinder             75.0          123       60.9756
2       Donn Cantrell            158.0          275       57.4545
3       Hayden Neloms            107.0          202       52.9703
4      Cecily Lampkin            107.0          203       52.7094
5     Maureen Marcano            149.0          285       52.2807
6      James Ascencio            135.0          267       50.5618
7      Wilburn Farren             55.0          110       50.0000
8         Moses Frase            129.0          260       49.6154
9  Jonathan Berthelot            171.0          345       49.5652

### 3. Find the average deal size for each product.

In [16]:
query = f"""SELECT product,avg(close_value) as Avg_deal_size 
            from sales_pipeline 
            group by product
            order by Avg_deal_size desc ;"""
table_data = pd.read_sql(query,engine)
display(table_data)

          product  Avg_deal_size
0         GTK 500   16024.480000
1    GTX Plus Pro    3529.732886
2          GTXPro    3060.660854
3     MG Advanced    2044.637454
4  GTX Plus Basic     671.051380
5       GTX Basic     347.676184
6      MG Special      35.787408

### 4. Identify which sector contributes the most total revenue .

In [17]:
query = f"""SELECT sector,sum(revenue) as Total_revenue 
            from accounts 
            group by sector 
            order by  Total_revenue desc limit 1;"""
table_data = pd.read_sql(query,engine)
display(table_data)

     sector  Total_revenue
0  software       30950.45

### 5. Determine which company has won the most deals.

In [ ]:
query = f"""SELECT account,count(deal_stage) as most_won_deals 
            from sales_pipeline
            where deal_stage = 'Won' 
            group by account
            order by most_won_deals desc limit 1 ;"""
table_data = pd.read_sql(query,engine)
display(table_data)

    account  most_won_deals
0  Kan-code             115

In [11]:
import pandas as pd
df = pd.read_csv("CRM_Data/sales_pipeline.csv")
df.head()
type(df["close_date"][0])

str

In [12]:
df["engage_date"] = pd.to_datetime(df["engage_date"], format="%m/%d/%Y")
df["close_date"] = pd.to_datetime(df["close_date"], format="%m/%d/%Y")
df.to_sql('sales_pipeline', con=engine, if_exists='replace', index=False)

8800

### 6. Calculate the average sales cycle duration in days (difference between engage_date and close_date).

In [13]:
query = f"""SELECT 
    AVG(DATEDIFF(close_date, engage_date)) AS avg_sales_cycle_days
FROM sales_pipeline
WHERE close_date IS NOT NULL AND engage_date IS NOT NULL;
"""
table_data = pd.read_sql(query,engine)
display(table_data)

   avg_sales_cycle_days
0               47.9854

### 7. Find the month in which most deals were closed.

In [14]:
query = f"""SELECT MONTHNAME(close_date) as Months,
            count(MONTHNAME(close_date)) as Month_counts 
            from sales_pipeline 
            group by MONTHNAME(close_date) 
            order by Month_counts desc limit 1;"""
table_data = pd.read_sql(query,engine)
display(table_data)

  Months  Month_counts
0    May           805

### 8. Display the top-performing region (Central, East, West) based on Won deals‚Äô close_value.

In [6]:
query = f"""SELECT st.regional_office,sum(sp.close_value) as Total_Won_close_value 
            from sales_teams as st 
            join sales_pipeline as sp 
            on st.sales_agent = sp.sales_agent 
            where sp.deal_stage = "Won"   
            group by st.regional_office 
            order by Total_Won_close_value desc  ;"""
table_data = pd.read_sql(query,engine)
display(table_data)

  regional_office  Total_Won_close_value
0            West              3568647.0
1         Central              3346293.0
2            East              3090594.0

### 9. Show total revenue per manager .

In [7]:
query = f"""select st.manager,sum(ac.revenue) as Total_revenue 
            from accounts as ac 
            join sales_pipeline as sp 
            on ac.account = sp.account 
            join sales_teams as st  
            on sp.sales_agent =st.sales_agent 
            group by st.manager ;"""
table_data = pd.read_sql(query,engine)
display(table_data)

            manager  Total_revenue
0  Dustin Brinkmann     2650522.83
1     Melvin Marxen     3281125.14
2     Summer Sewald     4183000.39
3      Celia Rouche     2992595.79
4     Rocco Neubert     3002154.51
5        Cara Losch     2088528.42

### 10. List all deals where the product series is ‚ÄúGTX‚Äù and status is ‚ÄúWon‚Äù.

In [ ]:
query = f"""SELECT * from products as p 
            join sales_pipeline as sp 
            on p.product = sp.product 
            where p.series = "GTX" and sp.deal_stage = "Won" ;"""
table_data = pd.read_sql(query,engine)
display(table_data)

,product,series,sales_price,opportunity_id,sales_agent,product,account,deal_stage,engage_date,close_date,close_value
0,GTX Plus Basic,GTX,1096,1C1I7A6R,Moses Frase,GTX Plus Basic,Cancity,Won,2016-10-20,2017-03-01,1054
1,GTX Basic,GTX,550,MV1LWRNH,Moses Frase,GTX Basic,Codehow,Won,2016-10-25,2017-03-09,588
2,GTX Basic,GTX,550,PE84CX4O,Zane Levy,GTX Basic,Hatfan,Won,2016-10-25,2017-03-02,517
3,GTX Basic,GTX,550,7GN8Q4LL,Markita Hansen,GTX Basic,Cheers,Won,2016-11-01,2017-03-07,601
4,GTX Plus Basic,GTX,1096,OLK9LKZB,Niesha Huffines,GTX Plus Basic,Zumgoity,Won,2016-11-01,2017-03-03,1026
...,...,...,...,...,...,...,...,...,...,...,...
2042,GTX Basic,GTX,550,3MXS2HRE,Cassey Cress,GTX Basic,Ganjaflex,Won,2017-12-23,2017-12-31,576
2043,GTX Basic,GTX,550,1YBATFAY,James Ascencio,GTX Basic,Singletechno,Won,2017-12-24,2017-12-26,538
2044,GTX Basic,GTX,550,2EBLR9N8,Lajuana Vencill,GTX Basic,Conecom,Won,2017-12-24,2017-12-26,622
2045,GTX Plus Basic,GTX,1096,VDGA4KXA,Violet Mclelland,GTX Plus Basic,Bluth Company,Won,2017-12-24,2017-12-30,1093
2046,GTX Plus Basic,GTX,1096,YJTQSZ9D,Gladys Colclough,GTX Plus Basic,Inity,Won,2017-12-27,2017-12-30,1052